/*
Made by Aine
*/

let handler = async (m, { conn }) => {
	let img = 'https://s6.uupload.ir/files/1615930905-_85tx.jpg'
	let dares = [
"زبونت رو از دهنت بیار بیرون و از خودت سلفی بگیر و بعد سلفی رو داخل گروه ارسال کن",
"شماره یکی از اعضای خونوادت رو  بفرست داخل گروه",
"داخل یه ویس به مدت 10 ثانیه بلند جیغ بکش",
"برو بیرون و به یه نفر گل بده :) فیلم یادت نره",
"از گالریت عکس بده",
"از آخرین سرچ های گوگلت عکس بده",
"از مخاطبینت عکس بده",
"اعضای گروه یه ناشناس انخاب میکنن. تو بهش پیام بده و بگو که دوستش داری",
"با یکی از بچه های گروه قرار بذار",
"شماره یا آیدی کراشتو بفرست :)",
"به خونوادت بگو حامله ای. فیلم یادت نره (;",
"یه اهنگ که بچه های گروه برات میفرستنو جلوی خونوادت گوش کن",
"زنگ بزن به شماره ای که بچه های گروه بهت میدن و بگو میخواستم یه پیتزا سفارش بدم :)",
"به مامان یا بابات بگو من رل زدم",
"یه پیام برای سازنده بفرست : wa.me/989301860610",
"از سومین چت واتساپت عکس بفرست",
"لفت بده",
"وارد سایت بنیاد نیکوکاری فرشته ها شو و در حد وسعت بهشون کمک مالی کن (;",
"برو داخل خیابون و به مردم لبخند بزن :)",
"آهنگ بی تی اس گوش کن و نظرتو داخل گروه بگو 😅"
] // tambahin kata kata sendiri 
	conn.sendFile(m.chat, img, 'maker.jpeg', `*جرات*\n\n“${pickRandom(dares)}”`, m, false, { thumbnail: Buffer.alloc(0) })
}
handler.help = ['dare']
handler.tags = ['fun']
handler.command = /^(dare|berani|tantangan)$/i
handler.limit = true

module.exports = handler

function pickRandom(list) {
  return list[Math.floor(list.length * Math.random())]
}
